<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release version of Native Access and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.andyfarthing.munki.nativeaccess</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Native Access</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Native Instruments</string>
		<key>MUNKI_CATEGORY</key>
		<string>Multimedia</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Native Access is your one-stop hub for easy product installation, registration, and updates. Open Native Access and log into your Native Instruments account to get set up.</string>
			<key>developer</key>
			<string>Native Instruments.</string>
			<key>display_name</key>
			<string>Native Access</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
            <string>

			#!/bin/bash

			launchDaemon="/Library/LaunchDaemons/com.native-instruments.NativeAccess.Helper2.plist"
			helperToolPath="/Library/PrivilegedHelperTools/com.native-instruments.NativeAccess.Helper2"
			helperTool="com.native-instruments.NativeAccess.Helper2"

			# Copy the Privileged Helper Tool
			/bin/cp -f "/Applications/Native Access.app/Contents/Library/LaunchServices/$helperTool" "$helperToolPath"

			# Check for and delete any pre-existing Launch Daemon
			if [[ -e "$launchDaemon" ]]; then
				/bin/launchctl unload "$launchDaemon"
				rm -rf "$launchDaemon"
			fi

			# Create the new Launch Daemon
			/usr/libexec/PlistBuddy -c "Add Label string" "$launchDaemon"
			/usr/libexec/PlistBuddy -c "Set Label $helperTool" "$launchDaemon"

			/usr/libexec/PlistBuddy -c "Add MachServices dict" "$launchDaemon"
			/usr/libexec/PlistBuddy -c "Add MachServices:$helperTool bool" "$launchDaemon"
			/usr/libexec/PlistBuddy -c "Set MachServices:$helperTool true" "$launchDaemon"

			/usr/libexec/PlistBuddy -c "Add Program string" "$launchDaemon"
			/usr/libexec/PlistBuddy -c "Set Program $helperToolPath" "$launchDaemon"

			/usr/libexec/PlistBuddy -c "Add ProgramArguments array" "$launchDaemon"
			/usr/libexec/PlistBuddy -c "Add ProgramArguments:0 string" "$launchDaemon"
			/usr/libexec/PlistBuddy -c "Set ProgramArguments:0 $helperToolPath" "$launchDaemon"

			/bin/launchctl load "$launchDaemon"

			exit 0
			
			</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.andyfarthing.download.native_access</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
            	<key>additional_pkginfo</key>
            	<dict>
            		<key>version</key>
            		<string>%version%</string>
            	</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
