<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Builds a package that places outset scripts into the correct folder.</string>
    <key>Identifier</key>
    <string>com.github.andyfarthing.deploy_outset_scripts</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ysju-deploy_outset_scripts</string>
        <key>URL</key>
        <string>https://github.com/andyfarthing/ysj-autopkg_recipes</string>
        <key>VERSION</key>
        <string>1.0</string>
        <key>PKG_ID</key>
        <string>com.github.andyfarthing.deployoutsetscripts</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Create a pkg root</string>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/autopkg_root</string>
                <key>pkgdirs</key>
                <dict>
                    <key>usr</key>
                    <string>0755</string>
                    <key>usr/local</key>
                    <string>0755</string>
                    <key>usr/local/outset</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy scripts into offset directory</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_DIR%/payload/boot-once</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/outset/</string>
                <key>source_path</key>
                <string>%RECIPE_DIR%/payload/boot-every</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/outset/</string>
                <string>%RECIPE_DIR%/payload/login-once</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/outset/</string>
                <string>%RECIPE_DIR%/payload/login-every</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/outset/</string>
                <string>%RECIPE_DIR%/payload/login-priveleged-once</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/outset/</string>
                <string>%RECIPE_DIR%/payload/login-priveleged-every</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/outset/</string>
            </dict>
        </dict>
         <dict>
            <key>Comment</key>
            <string>Build the package</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%VERSION%</string>
                    <key>version</key>
                    <string>%VERSION%</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_DIR%/build</string>
                    <key>id</key>
                    <string>%PKG_ID%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>/usr/local/outset</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>