<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of eLicenser Control Center and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.ysju-performance.munki.eLicenserControlCenter</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>eLicenser Control Center</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>MUNKI_CATEGORY</key>
		<string>licensing</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>The eLicenser Control Center is a utility that allows for managing music software licenses by a variety of manufacturers.</string>
			<key>developer</key>
			<string>Steinberg</string>
			<key>display_name</key>
			<string>eLicenser Control Center</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
    <string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ysju-performance.download.eLicenserControlCenter</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
            	<key>additional_pkginfo</key>
            	<dict>
            		<key>version</key>
            		<string>%version%</string>
            	</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%/eLicenserControlSetup.app</string>
				<key>uninstaller_pkg_path</key>
				<string>%pathname%/eLC-Uninstaller.app</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
