<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Builds a package that places desktop wallpapers into the correct folder.</string>
    <key>Identifier</key>
    <string>com.github.andyfarthing.deploy_wallpapers</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>deploy_wallpapers</string>
        <key>VERSION</key>
        <string>1.0</string>
        <key>PKG_ID</key>
        <string>com.github.andyfarthing.deploy_wallpapers</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_DIR%/payload</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_DIR%/build</string>
                    <key>pkgname</key>
                    <string>%NAME%-%VERSION%</string>
                    <key>id</key>
                    <string>%PKG_ID%</string>
                    <key>version</key>
                    <string>%VERSION%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>