<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the most recent version of appleloops script by carlashley from https://github.com/carlashley/appleloops</string>
    <key>Identifier</key>
    <string>com.github.ysju-performance.download.appleloops_tool</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Apple Loops Downloader Tool</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
<array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>carlashley/appleloops</string>
                <key>re_pattern</key>
                <string>appleloops-(?P&lt;version&gt;(\d.\d.\d)+)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>