<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Builds a package that places outset scripts into the correct folder.</string>
    <key>Identifier</key>
    <string>com.github.andyfarthing.pkg.propellerheadreason</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Propellerhead Reason</string>
        <key>URL</key>
        <string>https://github.com/ysju-performance/autopkg_recipes</string>
        <key>VERSION</key>
        <string>1.0</string>
        <key>PKG_ID</key>
        <string>com.github.ysjuperformance.propellerheadreason</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.andyfarthing.download.propellerheadreason</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Create a pkg root</string>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/autopkg_root</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy Reason dir from dmg into /Applications</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/Reason %REASON_MAIN_VERS%/</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/Reason %REASON_MAIN_VERS%</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Build the package</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%REASON_MAIN_VERS%.%version%</string>
                    <key>version</key>
                    <string>%REASON_MAIN_VERS%.%version%</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>pkgroot</key>
                    <string>%pkgroot%</string>
                    <key>id</key>
                    <string>%PKG_ID%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>/Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
        <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <string>%pkgroot%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>