<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string></string>
    <key>Identifier</key>
    <string>com.github.andyfarthing.munki.propellerheadreason</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Multimedia</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/propellerheadreason</string>
        <key>NAME</key>
        <string>Reason</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Reason is easy to get started with, yet as deep as you want it to be. And it comes fully loaded with the instruments, effects and sounds your music making need. Create, compose, mix and finish your music–Reason will help you along the journey, from inspiration to mixdown.</string>
            <key>developer</key>
            <string>Propellerhead</string>
            <key>display_name</key>
            <string>Reason</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.andyfarthing.download.propellerheadreason</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Arguments</key>
    		<dict>
    			<key>additional_pkginfo</key>
    			<dict>
    				<key>version</key>
    				<string>$REASON_MAIN_VERS%.%version%</string>
    			</dict>
    		</dict>
    		<key>Processor</key>
    		<string>MunkiPkginfoMerger</string>
    	</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>